
#Область ОбработчикиСобытийФормы

 
&НаСервере
Процедура СД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаЗаполнитьРеквизитыПоДаннымЕГР.Видимость = Ложь;
	
	ИмяКоманды = "СД_ЗаполнитьПоИНН";
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие = ИмяКоманды;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	Команда.Заголовок = "Заполнить по ИНН";
	
	Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"),Элементы.КомандыВажно);
	Кнопка.ИмяКоманды = ИмяКоманды;
	
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы


&НаКлиенте
Асинх Процедура СД_ЗаполнитьПоИНН(Команда)
	
	//ОбщегоНазначенияКлиент.СообщитьПользователю("Получаем данные...");
	ИНН = Ждать ВвестиСтрокуАсинх(,"Введите ИНН",12);
	
	Если  ИНН = Неопределено Тогда
		Возврат ;
	КонецЕсли; 
	
	Если СтрДлина(ИНН) < 10 Тогда 
		ПредупреждениеАсинх("Некорректный ИНН... Повторите ввод");
		Возврат ;
	КонецЕсли;
	
	 ДанныеКонтрагента = СД_ПолучитьДанныеКонтрагентаПоИНН(ИНН);
	 
	 СД_ЗаполнитьРеквизитыКонтрагентаПоИНН(ДанныеКонтрагента);
	
 КонецПроцедуры
 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


 &НаСервере
 Процедура СД_ЗаполнитьРеквизитыКонтрагентаПоИНН(ДанныеКонтрагента) 
	 
	     ЗаполнитьЗначенияСвойств(Объект, ДанныеКонтрагента);
		 
		 НоваяКонтактнаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	
	Если ДанныеКонтрагента.Свойство("ЮридическийАдрес") И ДанныеКонтрагента.ЮридическийАдрес <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = ДанныеКонтрагента.ЮридическийАдрес;
		ДанныеКИ.Значение = "";
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = ДанныеКонтрагента.ЮридическийАдрес;
		ДанныеКИ.Значение = "";
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	КонецЕсли;
    УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(Объект, НоваяКонтактнаяИнформация);
	ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, Объект, ИмяЭлементаДляРазмещения);
	
	ЗаполнитьВидКонтрагента();
	УстановитьЗаголовокЮридическихДанных(ЭтотОбъект);
	
 КонецПроцедуры
 
 
 &НаСервереБезКонтекста
 Функция СД_ПолучитьДанныеКонтрагентаПоИНН(ИНН)
	 
	 ДанныеКонтрагента = Новый Структура;
	 ДанныеКонтрагента.Вставить("ИНН", ИНН);
	 
	//https://egrul.itsoft.ru/short_data/?3445071523	 
	 АдресСервера = "egrul.itsoft.ru"; 
	
	 АдресРесурса = СтрШаблон("/short_data/?%1",ИНН);
	 
	 ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	 
	 Соединение = Новый HTTPСоединение(АдресСервера,,,,,30,ЗащищенноеСоединение);
	 Запрос = Новый HTTPЗапрос(АдресРесурса);
	 
	 Попытка
		 Ответ = Соединение.Получить(Запрос);
	 Исключение 
		 ОбщегоНазначения.СообщитьПользователю("Не удалось получить данные по ИНН " + ОписаниеОшибки());
		 Возврат ДанныеКонтрагента;
	 КонецПопытки;
	 
	 СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();

	 ДанныеЮЛ = Неопределено;
	 Если Ответ.КодСостояния = 200 Тогда
		 ЧтениеJSON = Новый ЧтениеJSON;
		 ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		 
		Попытка
			ДанныеЮЛ = ПрочитатьJSON(ЧтениеJSON,Истина);
			ЧтениеJSON.Закрыть();
	 	Исключение
			ТекстСообщения = "Ошибка получения данных (ИНН не найден!!!)  " + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат ДанныеКонтрагента;
		КонецПопытки;	
	 
	 Иначе
		 ТекстСообщения = СтрШаблон("Получить данные по ИНН не удалось...
		 								|Код состояния: %1
										|Ответ сервера: %2",Ответ.КодСостояния,СтрокаJSON);
		 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		  Возврат ДанныеКонтрагента;
	  КонецЕсли;
	  
	  Если ДанныеЮЛ["short_form"] <> Неопределено И
		  ДанныеЮЛ["short_form"] = "ИП" Тогда 
		  
		  ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
	  Иначе
		  ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;  
	  КонецЕсли; 
	  
	    ДанныеКонтрагента.Вставить("ВидКонтрагента", ВидКонтрагента);
	    ДанныеКонтрагента.Вставить("РегистрационныйНомер",ДанныеЮЛ["ogrn"]);
	    ДанныеКонтрагента.Вставить("КПП",ДанныеЮЛ["kpp"]);
	    ДанныеКонтрагента.Вставить("Наименование",ДанныеЮЛ["short_name"]);
		ДанныеКонтрагента.Вставить("НаименованиеПолное", ДанныеЮЛ["full_name"]);
		
		Если ДанныеЮЛ["address"] <> Неопределено Тогда
			ДанныеКонтрагента.Вставить("ЮридическийАдрес", ДанныеЮЛ["address"]);
		КонецЕсли;
		
		Возврат ДанныеКонтрагента;
		
 КонецФункции


#КонецОбласти



