
#Область СлужебныеПроцедурыИФункции

Процедура РеализацияТоваров_ПриСозданииНаСервереПосле(Форма)Экспорт
	Элементы = Форма.Элементы;
	
	//Добавление команды на форму
	КомандаФормы = Форма.Команды.Добавить("РП_ЗаполнитьШтрихкод");
	КомандаФормы.Заголовок = "Заполнить штрихкод";
	КомандаФормы.Действие = "РП_КомандаЗаполнитьШтрихкод";
	
	//Добавление кнопки на форму
	Кнопка = Элементы.Вставить("РП_ЗаполнитьШтрихкод",Тип("КнопкаФормы"),
		Элементы.ГруппаТоварыПодобратьТовары, Элементы.ТоварыУказатьСерии);
	Кнопка.ИмяКоманды = "РП_ЗаполнитьШтрихкод";
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.Картинка = БиблиотекаКартинок.ВложеннаяТаблица;
	Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	//Добавление реквизита на форму
	КвалификаторыСтроки = Новый КвалификаторыСтроки(200,ДопустимаяДлина.Фиксированная);
	ОписаниеТипа = Новый ОписаниеТипов("Строка",,,,КвалификаторыСтроки,,);
	РеквизитШтрихкод = Новый РеквизитФормы("ГП_Штрихкод",ОписаниеТипа,"Объект.Товары","Штрихкод",Ложь);
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(РеквизитШтрихкод);
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
	//Добавление элемента в таблицу Товары
	ЭлементШтрихкод = Элементы.Вставить("ГП_Штрихкод",Тип("ПолеФормы"),Элементы.Товары, Элементы.ТоварыКодТНВЭД);
	ЭлементШтрихкод.ПутьКДанным = "Объект.Товары.ГП_Штрихкод";
	ЭлементШтрихкод.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементШтрихкод.ТолькоПросмотр = Истина;
	
	
	
КонецПроцедуры


#КонецОбласти