

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура РП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	РП_РаботаСФормамиНаСервере.РеализацияТоваров_ПриСозданииНаСервереПосле(ЭтотОбъект);
	
	Если Объект.Товары.Количество() > 0 Тогда
		РП_РаботаСДокументамиНаСервере.ЗаполнитьШтрихкод(Объект.Товары);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РП_КомандаЗаполнитьШтрихкод (Команда)
	
	Если Объект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьШтрихкодНаСервере();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШтрихкодНаСервере() 
	
	РП_РаботаСДокументамиНаСервере.ЗаполнитьШтрихкод(Объект.Товары);
	
КонецПроцедуры
#КонецОбласти