
Функция ШтрихкодНоменклатуры (Номенклатура, Характеристика, Упаковка)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
		|	И ШтрихкодыНоменклатуры.Упаковка = &Упаковка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Штрихкод";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	ШтрихкодИтого = "";
	Пока Выборка.Следующий() Цикл
		
		ШтрихкодИтого = ШтрихкодИтого + ?(ШтрихкодИтого = "","",Символы.ПС) + Выборка.Штрихкод;
		
	КонецЦикла;
	
	Возврат ШтрихкодИтого;
КонецФункции

Процедура ЗаполнитьШтрихкодыДокумента (Объект, ИмяТЧ, Правильно = Ложь)Экспорт 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика, ШтрихкодыНоменклатуры.Упаковка) В
		|			(ВЫБРАТЬ
		|				Т.Номенклатура,
		|				Т.Характеристика,
		|				Т.Упаковка
		|			ИЗ
		|				втТЧТовары КАК Т)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Штрихкод
		|ИТОГИ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Товары", Объект[ИмяТЧ].Выгрузить(,"Номенклатура, Характеристика, Упаковка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
	
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаХарактеристика.Следующий() Цикл
	
			ВыборкаУпаковка = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаУпаковка.Следующий() Цикл
	
				Выборка = ВыборкаУпаковка.Выбрать();
				ШтрихКодИтого = "";
				Пока Выборка.Следующий() Цикл
					ШтрихкодИтого = ШтрихкодИтого + ?(ШтрихкодИтого = "","",Символы.ПС) + Выборка.Штрихкод;	
				КонецЦикла;
				
				ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика, Упаковка");
				ЗаполнитьЗначенияСвойств(ПараметрыОтбора,ВыборкаУпаковка);
				
				НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыОтбора);
				Для Каждого Строка Из НайденныеСтроки Цикл
					Если Правильно Тогда 
						Строка.ШК_ШтрихкодПравильный = ШтрихкодИтого ;
					Иначе
						Строка.ШК_Штрихкод = ШтрихкодИтого;
					КонецЕсли;
				КонецЦикла;
				
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

