

#Область НеправильныеРешения
&НаКлиенте
Процедура ШК_шкЗаполнитьШтрихкоды1После(Команда)
	
	Для Каждого Строка Из Объект.Товары Цикл 
		
		Строка.ШК_Штрихкод = ШК_РаботаСоШтрихкодами.ШтрихкодНоменклатуры(
								Строка.Номенклатура, Строка.Характеристика, Строка.Упаковка);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ШК_шкЗаполнитьШтрихкоды2После(Команда)
	
	ЗаполнитьШтрихкодыНаСервере2();
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШтрихкодыНаСервере2()
	
	Для Каждого Строка Из Объект.Товары Цикл 
		
		Строка.ШК_Штрихкод = ШК_РаботаСоШтрихкодами.ШтрихкодНоменклатуры(
								Строка.Номенклатура, Строка.Характеристика, Строка.Упаковка);
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте

Процедура ШК_шкЗаполнитьШтрихкоды3После(Команда)
	
		ЗаполнитьШтрихкоды3НаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьШтрихкоды3НаСервере()
	
	ШК_РаботаСоШтрихкодами.ЗаполнитьШтрихкодыДокумента(Объект,"Товары");
	
КонецПроцедуры

#КонецОбласти


#Область ПравильноеРешение

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ШК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Добавление команды на форму в раздел команды
	КомандаФормы = Команды.Добавить("ШК_ЗаполнитьШтрихкодыПравильно");//имя команды
	КомандаФормы.Заголовок = "Заполнить штрихкод";
	КомандаФормы.Действие = "ШК_КомандаЗаполнитьШтрихкодыПравильно";//обработчик команды
	
	//добавление кнопки (элемент формы) на форму в раздел элементы
	
	Кнопка = Элементы.Вставить("ШК_ЗаполнитьШтрихкоды",Тип("КнопкаФормы"),
		Элементы.Товары.КоманднаяПанель,Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаОбеспечение);
	Кнопка.Заголовок = "Зап.ш/коды (прав)";
	Кнопка.ИмяКоманды = "ШК_ЗаполнитьШтрихкодыПравильно";//связь с командой по имени
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
	//Добавление реквизита формы в раздел реквизиты формы
	КвалификаторыСтроки = Новый КвалификаторыСтроки(200,ДопустимаяДлина.Фиксированная);
	ОписаниеТипа = Новый ОписаниеТипов("Строка",,,,КвалификаторыСтроки,,);
	РеквизитШтрихкод = Новый РеквизитФормы("ШК_ШтрихкодПравильный",ОписаниеТипа,"Объект.Товары","Штрихкод(прав)",Ложь);
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(РеквизитШтрихкод);
	ИзменитьРеквизиты(МассивРеквизитов);
	
	//Добавление элемента в табличную часть
	ЭлементФормы = Элементы.Вставить("шкШтрихкод",Тип("ПолеФормы"),Элементы.Товары,Элементы.ТоварыХарактеристика);
	ЭлементФормы.Заголовок = "Штрихкод(прав)";
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = "Объект.Товары.ШК_ШтрихкодПравильный";
	
	Правильно = Истина;
	ШК_РаботаСоШтрихкодами.ЗаполнитьШтрихкодыДокумента(Объект,"Товары", Правильно);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШК_КомандаЗаполнитьШтрихкодыПравильно (Команда)
	
	ШК_КомандаЗаполнитьШтрихкодыПравильноНаСервере();
	
КонецПроцедуры	
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ШК_КомандаЗаполнитьШтрихкодыПравильноНаСервере()
	
	Правильно = Истина;
	ШК_РаботаСоШтрихкодами.ЗаполнитьШтрихкодыДокумента(Объект,"Товары", Правильно);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти